src/Documents/Списание/Списание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Списание</name>
  <registerRecords>AccumulationRegister.Списание</registerRecords>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураАрхив</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Размещение</name>
      <type>
        <types>CatalogRef.Размещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/AccumulationRegisters/Списание/Списание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Списание</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Размещение</name>
    <type>
      <types>CatalogRef.Размещения</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Enums/Местоположения/Местоположения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Местоположения</name>
  <enumValues>
    <name>Дача</name>
  </enumValues>
  <enumValues>
    <name>Дом</name>
  </enumValues>
  <enumValues>
    <name>Автомобиль</name>
  </enumValues>
  <enumValues>
    <name>Ватутинки</name>
  </enumValues>
  <enumValues>
    <name>ЧеховМолодежная</name>
  </enumValues>
  <enumValues>
    <name>Корзина</name>
  </enumValues>
  <enumValues>
    <name>Перемещаемое</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>Несколько</name>
  </enumValues>
  <enumValues>
    <name>Неопределено</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Списание/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Для каждого Т Из Товары Цикл
		
		КоличествоПоРазмещению = НоменклатураСервер.ПолучитьКоличествоПоРазмещению(Номенклатура, Т.Размещение);
		
		Если Т.Количество > КоличествоПоРазмещению Тогда
			//Сообщить("Количество по размещению меньше, чем требуется списать: " + Т.Размещение + ", остаток: " + КоличествоПоРазмещению);
			//Отказ = Истина;
			Возврат;
		ИначеЕсли Т.Количество < КоличествоПоРазмещению Тогда	
			Списать = КоличествоПоРазмещению - Т.Количество;
			НоменклатураСервер.УстановитьКоличествоПоРазмещению(Номенклатура, Т.Размещение, Списать);
		Иначе	
			НоменклатураСервер.УдалитьРазмещение(Номенклатура, Т.Размещение);
		КонецЕсли;
		
	КонецЦикла;
	
	ТЗ_Остатки = НоменклатураСервер.ПолучитьОстатки(Номенклатура);
	НовоеКоличество = ТЗ_Остатки.Итог("Количество");
	
	НоменклатураСервер.УстановитьКоличество(Номенклатура, НовоеКоличество);
	
	Если НовоеКоличество = 0 Тогда
		Об = Номенклатура.ПолучитьОбъект();
		Об.Родитель				= НоменклатураАрхив;
		Об.ВариантРазмещения	= 0;
		Об.Местоположение		= Перечисления.Местоположения.Архив;
		Попытка
			Об.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;

	Движения.Списание.Записывать = Истина;
	Для Каждого Т Из Товары Цикл
		Движение = Движения.Списание.Добавить();
		Движение.Период			= Дата;
		Движение.Номенклатура	= Номенклатура;
		Движение.Размещение		= Т.Размещение;
		Движение.Количество		= Т.Количество;
	КонецЦикла;

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)




КонецПроцедуры

#КонецОбласти
